Revit 2027 API
RebarShapeTerminationsData.HasCrankAtStart Property
 Identifies if the rebar shape has crank at start. Setting this property to true, will set the HookAngleAtStart to 0 and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasCrankAtStart { get; set; }
Public Property HasCrankAtStart As Boolean
	Get
	Set
public:
property bool HasCrankAtStart {
	bool get ();
	void set (bool value);
}
member HasCrankAtStart : bool with get, set
Property Value
Boolean
See Also
Reference
RebarShapeTerminationsData Class
Autodesk.Revit.DB.Structure Namespace